[
  {
    "_id": "9781781102435",
    "googleId": "_oaAHiFOZmgC",
    "title": "Harry Potter and the Deathly Hallows",
    "authors": [
      "J.K. Rowling"
    ],
    "description": "'Give me Harry Potter,' said Voldemort's voice, 'and none shall be harmed. Give me Harry Potter, and I shall leave the school untouched. Give me Harry Potter, and you will be rewarded.' As he climbs into the sidecar of Hagrid's motorbike and takes to the skies, leaving Privet Drive for the last time, Harry Potter knows that Lord Voldemort and the Death Eaters are not far behind. The protective charm that has kept Harry safe until now is broken, but he cannot keep hiding. The Dark Lord is breathing fear into everything Harry loves and to stop him Harry will have to find and destroy the remaining Horcruxes. The final battle must begin - Harry must stand and face his enemy... Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "image": "https://books.google.com/books/content?id=_oaAHiFOZmgC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Pottermore Publishing",
    "yearPublished": 2015,
    "category": "Juvenile Fiction",
    "ISBN": "9781781102435",
    "language": "en",
    "pages": 769,
    "format": "BOOK",
    "averageRating": 4.5
  },
  {
    "_id": "9781781100486",
    "googleId": "wrOQLV6xB-wC",
    "title": "Harry Potter and the Sorcerer's Stone",
    "authors": [
      "J.K. Rowling"
    ],
    "description": "Turning the envelope over, his hand trembling, Harry saw a purple wax seal bearing a coat of arms; a lion, an eagle, a badger and a snake surrounding a large letter 'H'. Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin! Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "image": "https://books.google.com/books/content?id=wrOQLV6xB-wC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Pottermore Publishing",
    "yearPublished": 2015,
    "category": "Juvenile Fiction",
    "ISBN": "9781781100486",
    "language": "en",
    "pages": 311,
    "format": "BOOK",
    "averageRating": 4.5
  },
  {
    "_id": "9781781100516",
    "googleId": "Sm5AKLXKxHgC",
    "title": "Harry Potter and the Prisoner of Azkaban",
    "authors": [
      "J.K. Rowling"
    ],
    "description": "'Welcome to the Knight Bus, emergency transport for the stranded witch or wizard. Just stick out your wand hand, step on board and we can take you anywhere you want to go.' When the Knight Bus crashes through the darkness and screeches to a halt in front of him, it's the start of another far from ordinary year at Hogwarts for Harry Potter. Sirius Black, escaped mass-murderer and follower of Lord Voldemort, is on the run - and they say he is coming after Harry. In his first ever Divination class, Professor Trelawney sees an omen of death in Harry's tea leaves... But perhaps most terrifying of all are the Dementors patrolling the school grounds, with their soul-sucking kiss... Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "image": "https://books.google.com/books/content?id=Sm5AKLXKxHgC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Pottermore Publishing",
    "yearPublished": 2015,
    "category": "Fiction",
    "ISBN": "9781781100516",
    "language": "en",
    "pages": 445,
    "format": "BOOK",
    "averageRating": 4.5
  },
  {
    "_id": "9781781100509",
    "googleId": "5iTebBW-w7QC",
    "title": "Harry Potter and the Chamber of Secrets",
    "authors": [
      "J.K. Rowling"
    ],
    "description": "'There is a plot, Harry Potter. A plot to make most terrible things happen at Hogwarts School of Witchcraft and Wizardry this year.' Harry Potter's summer has included the worst birthday ever, doomy warnings from a house-elf called Dobby, and rescue from the Dursleys by his friend Ron Weasley in a magical flying car! Back at Hogwarts School of Witchcraft and Wizardry for his second year, Harry hears strange whispers echo through empty corridors - and then the attacks start. Students are found as though turned to stone... Dobby's sinister predictions seem to be coming true. Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "image": "https://books.google.com/books/content?id=5iTebBW-w7QC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Pottermore Publishing",
    "yearPublished": 2015,
    "category": "Fiction",
    "ISBN": "9781781100509",
    "language": "en",
    "pages": 344,
    "format": "BOOK",
    "averageRating": 4.5
  },
  {
    "_id": "9781781100547",
    "googleId": "R7YsowJI9-IC",
    "title": "Harry Potter and the Half-Blood Prince",
    "authors": [
      "J.K. Rowling"
    ],
    "description": "There it was, hanging in the sky above the school: the blazing green skull with a serpent tongue, the mark Death Eaters left behind whenever they had entered a building... wherever they had murdered... When Dumbledore arrives at Privet Drive one summer night to collect Harry Potter, his wand hand is blackened and shrivelled, but he does not reveal why. Secrets and suspicion are spreading through the wizarding world, and Hogwarts itself is not safe. Harry is convinced that Malfoy bears the Dark Mark: there is a Death Eater amongst them. Harry will need powerful magic and true friends as he explores Voldemort's darkest secrets, and Dumbledore prepares him to face his destiny... Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "image": "https://books.google.com/books/content?id=R7YsowJI9-IC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Pottermore Publishing",
    "yearPublished": 2015,
    "category": "Fiction",
    "ISBN": "9781781100547",
    "language": "en",
    "pages": 662,
    "format": "BOOK",
    "averageRating": 4.5
  },
  {
    "_id": "9780747589945",
    "googleId": "GDdCPgAACAAJ",
    "title": "Harry Potter and the Philosopher's Stone",
    "authors": [
      "J. K. Rowling"
    ],
    "description": "* Cult children's classic - 156,000 copies sold - already a hit with adults * This edition with stunningly reworked jacket creates new market for adult readers * Author has already received huge press coverage in the national papers and on television * Film deal soon to be signed * The sequel, Harry Potter and the Chamber of Secrets No. 1 (for four weeks) in hardback bestseller lists - the first time since Booktrack started that a children's hardback has topped the general bestseller list. * There's magic, humour, goodies, baddies, muggles (what are they?) and broomsticks * It's a book about good versus evil, self discovery, friendship and a rollicking good tale into the bargain! Harry Potter is an ordinary boy who lives in a cupboard under the stairs at his Aunt Petunia and Uncle Vernon's house, which he thinks is normal for someone like him who's parents have been killed in a 'car crash'. He is bullied by them and his fat, spoilt cousin Dudley, and lives a very unremarkable life with only the odd hiccup (like his hair growing back overnight!) to cause him much to think about. That is until an owl turns up with a letter addressed to Harry and all hell breaks loose! He is literally rescued by a world where nothing is as it seems and magic lessons are the order of the day. Read and find out how Harry discovers his true heritage at Hogwarts School of Wizardry and Witchcraft, the reason behind his parents mysterious death, who is out to kill him, and how he uncovers the most amazing secret of all time, the fabled Philosopher's Stone! The Author: This is J K Rowlings's first book and she has six more books planned for Harry's adventures at Hogwarts. She lives in Edinburgh.",
    "image": "https://books.google.com/books/content?id=GDdCPgAACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Bloomsbury Publishing",
    "yearPublished": 2007,
    "category": "Children's stories",
    "ISBN": "9780747589945",
    "language": "en",
    "pages": 223,
    "format": "BOOK",
    "averageRating": 4.5
  },
  {
    "_id": "9781781100523",
    "googleId": "etukl7GfrxQC",
    "title": "Harry Potter and the Goblet of Fire",
    "authors": [
      "J.K. Rowling"
    ],
    "description": "'There will be three tasks, spaced throughout the school year, and they will test the champions in many different ways ... their magical prowess - their daring - their powers of deduction - and, of course, their ability to cope with danger.' The Triwizard Tournament is to be held at Hogwarts. Only wizards who are over seventeen are allowed to enter - but that doesn't stop Harry dreaming that he will win the competition. Then at Hallowe'en, when the Goblet of Fire makes its selection, Harry is amazed to find his name is one of those that the magical cup picks out. He will face death-defying tasks, dragons and Dark wizards, but with the help of his best friends, Ron and Hermione, he might just make it through - alive! Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "image": "https://books.google.com/books/content?id=etukl7GfrxQC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Pottermore Publishing",
    "yearPublished": 2015,
    "category": "Fiction",
    "ISBN": "9781781100523",
    "language": "en",
    "pages": 750,
    "format": "BOOK",
    "averageRating": 4.5
  },
  {
    "_id": "9781781103685",
    "googleId": "GjgQCwAAQBAJ",
    "title": "Harry Potter e a Pedra Filosofal",
    "authors": [
      "J.K. Rowling"
    ],
    "description": "Quando virou o envelope, com a mão trêmula, Harry viu um lacre de cera púrpura com um brasão; um leão, uma águia, um texugo e uma cobra circulando uma grande letra \"H\". Harry Potter nunca havia ouvido falar de Hogwarts quando as cartas começaram a aparecer no capacho da Rua dos Alfeneiros, no 4. Escritos a tinta verde-esmeralda em pergaminho amarelado com um lacre de cera púrpura, as cartas eram rapidamente confiscadas por seus pavorosos tio e tia. Então, no aniversário de onze anos de Harry, um gigante com olhos que luziam como besouros negros chamado Rúbeo Hagrid surge com notícias surpreendentes: Harry Potter é um bruxo e tem uma vaga na Escola de Magia e Bruxaria de Hogwarts. Uma incrível aventura está para começar!",
    "image": "https://books.google.com/books/content?id=GjgQCwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Pottermore Publishing",
    "yearPublished": 2015,
    "category": "Juvenile Fiction",
    "ISBN": "9781781103685",
    "language": "pt-BR",
    "pages": 317,
    "format": "BOOK",
    "averageRating": 3.5
  },
  {
    "_id": "9780812694550",
    "googleId": "Gz8t2MttEQUC",
    "title": "Harry Potter and Philosophy",
    "authors": [
      "David Baggett"
    ],
    "description": "In 'Harry Potter and Philosophy', 17 philosophical experts unlock some of Hogwarts' secret panels, and uncover surprising insights that are enlightening both for wizards and the most discerning muggles.",
    "image": "https://books.google.com/books/content?id=Gz8t2MttEQUC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Open Court Publishing",
    "yearPublished": 2004,
    "category": "Literary Criticism",
    "ISBN": "9780812694550",
    "language": "en",
    "pages": 266,
    "format": "BOOK",
    "averageRating": 5
  },
  {
    "_id": "9781408855935",
    "googleId": "FmwwDQAAQBAJ",
    "title": "Harry Potter and the Order of the Phoenix",
    "authors": [
      "J. K. Rowling"
    ],
    "description": "Fantasy. Da Harry Potter vender tilbage til Hogwarts er meget ændret. Man tror, at han lyver angående Voldemort, og ministeriet sender en repræsentant til skolen, der snart er delt i to fjendtlige lejre",
    "image": "https://books.google.com/books/content?id=FmwwDQAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Bloomsbury Publishing",
    "yearPublished": 2014,
    "category": "Fiction",
    "ISBN": "9781408855935",
    "language": "en",
    "pages": 815,
    "format": "BOOK",
    "averageRating": 3
  }
]