[
  {
    "googleId": "xmwfNvLH0EEC",
    "title": "Little Women",
    "authors": [
      "Louisa May Alcott"
    ],
    "description": "Chronicles the joys and sorrows of the four March sisters as they grow into young women in nineteenth-century New England.",
    "image": "https://books.google.com/books/content?id=xmwfNvLH0EEC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "I. E. Clark Publications",
    "yearPublished": 1995,
    "category": "Drama",
    "ISBN": "9780886804121",
    "language": "en",
    "pages": 100,
    "format": "BOOK",
    "averageRating": 5
  },
  {
    "googleId": "NlDUDwAAQBAJ",
    "title": "Little Women",
    "authors": [
      "Louisa May Alcott"
    ],
    "description": "One of the best loved books of all time. Nominated as one of America’s best-loved novels by PBS’s The Great American Read Lovely Meg, talented Jo, frail Beth, spoiled Amy: these are hard lessons of poverty and of growing up in New England during the Civil War. Through their dreams, plays, pranks, letters, illnesses, and courtships, women of all ages have become a part of this remarkable family and have felt the deep sadness when Meg leaves the circle of sisters to be married at the end of Part I. Part II, chronicles Meg's joys and mishaps as a young wife and mother, Jo's struggle to become a writer, Beth's tragedy, and Amy's artistic pursuits and unexpected romance. Based on Louisa May Alcott's childhood, this lively portrait of nineteenth- century family life possesses a lasting vitality that has endeared it to generations of readers. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
    "image": "https://books.google.com/books/content?id=NlDUDwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Penguin",
    "yearPublished": 1989,
    "category": "Fiction",
    "ISBN": "9780140390698",
    "language": "en",
    "pages": 546,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "xHbaFO0ow3kC",
    "title": "Little Women",
    "authors": [
      "Louisa May Alcott"
    ],
    "description": "",
    "image": "https://books.google.com/books/content?id=xHbaFO0ow3kC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 1880,
    "category": "Children's literature",
    "ISBN": "",
    "language": "en",
    "pages": 370,
    "format": "BOOK",
    "averageRating": 3
  },
  {
    "googleId": "hQbEDAAAQBAJ",
    "title": "Little Women : Om Illustrated Classics",
    "authors": [
      "Louisa M Alcott"
    ],
    "description": "Little Women is the story of how the four sisters Jo, Meg, Amy and Beth grow up, find love and their place in the world under the loving and watchful eyes of their beloved Marmee. The little women together with their mother keep the home fires burning while their preacher father serves with the Union army during the American Civil War. The family struggles to make ends meet, with the help of their kind and wealthy neighbour, Mr. Laurence, and his highspirited grandson Laurie. The book shows how in all times, love and hope are the most faithful companions when all else fails. Honest and true intentions are really the most valuable possessions one can have. The novel emphasises the beauty of simplicity and the importance of small",
    "image": "https://books.google.com/books/content?id=hQbEDAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Om Books International",
    "yearPublished": 2018,
    "category": "Fiction",
    "ISBN": "9789382607151",
    "language": "en",
    "pages": 121,
    "format": "BOOK",
    "averageRating": 4.5
  },
  {
    "googleId": "mMmSPwAACAAJ",
    "title": "Little Women",
    "authors": [
      "Archie Oliver",
      "Louisa May Alcott"
    ],
    "description": "Watch and pray, dear, never get tired of trying, and never think it is impossible to conquer your fault.It's Christmas Eve in the March household, but this will be a Christmas like no other: their father is away fighting in the American Civil War and the March sisters and their mother must try to make ends meet while their father is at war. Although life can be hard for the family, and times are tough, this is an extraordinary story of triumph over adversity, recounting in exquisite detail, the lives, loves, trials, and triumphs of these four very different sisters. The stories of Jo, Beth, Amy, and Meg have charmed readers over five generations and has earned its place as a classic coming of age novel.",
    "image": "https://books.google.com/books/content?id=mMmSPwAACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2004,
    "category": "Families",
    "ISBN": "9781741210194",
    "language": "en",
    "pages": 175,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "3dOtBAAAQBAJ",
    "title": "Little Women (illustrated)",
    "authors": [
      "Louisa May Alcott"
    ],
    "description": "Little Women is one of the most widely read novels. Ruth MacDonald argued that \"Louisa May Alcott stands as one of the great American practitioners of the girls' novel and the family story.\" In the 1860s, gendered separation of children's fiction was a newer division in literature. This division signaled a beginning of polarization of gender roles as social constructs \"as class stratification increased\". Joy Kasson wrote, \"Alcott chronicled the coming of age of young girls, their struggles with issues such as selfishness and generosity, the nature of individual integrity, and, above all, the question of their place in the world around them.\" Girls related to the March sisters in Little Women, along with following the lead of their heroines, by assimilating aspects of the story into their own lives.",
    "image": "https://books.google.com/books/content?id=3dOtBAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Osmora Incorporated",
    "yearPublished": 2014,
    "category": "Fiction",
    "ISBN": "9782765904762",
    "language": "en",
    "pages": 582,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "oEq0KVM9BN8C",
    "title": "Little Women",
    "authors": [
      "Louisa May Alcott"
    ],
    "description": "Little Women is the heartwarming story of the March family that has thrilled generations of readers. It is the story of four sisters--Jo, Meg, Amy and Beth-- and of the courage, humor and ingenuity they display to survive poverty and the absence of their father during the Civil War.",
    "image": "https://books.google.com/books/content?id=oEq0KVM9BN8C&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Signet Classics",
    "yearPublished": 1983,
    "category": "American fiction",
    "ISBN": "9780451523419",
    "language": "en",
    "pages": 488,
    "format": "BOOK",
    "averageRating": 4
  },
  {
    "googleId": "HfJwBgAAQBAJ",
    "title": "The Annotated Little Women (The Annotated Books)",
    "authors": [
      "Louisa May Alcott"
    ],
    "description": "The Pulitzer Prize–winning biographer of Louisa May Alcott illuminates the world of Little Women and its author. Since its publication in 1868–69, Little Women, perhaps America’s most beloved children’s classic, has been handed down from mother to daughter for generations. It has been translated into more than fifty languages and inspired six films, four television shows, a Broadway musical, an opera, and a web series. This lavish, four-color edition features over 220 curated illustrations, including stills from the films, stunning art by Norman Rockwell, and iconic illustrations by children’s-book illustrators Alice Barber Stevens, Frank T. Merrill, and Jessie Wilcox Smith. Renowned Alcott scholar John Matteson brings his expertise to the book, to the March family it creates, and to the Alcott family who inspired it all. Through numerous photographs taken in the Alcott family home expressly for this edition—elder daughter Anna’s wedding dress, the Alcott sisters’ theater costumes, sister May’s art, and Abba Alcott’s recipe book—readers discover the extraordinary links between the real and the fictional family. Matteson’s annotations evoke the once-used objects and culture of a distant but still-relevant time, from the horse-drawn carriages to the art Alcott carefully placed in her story to references to persons little known today. His brilliant introductory essays examine Little Women’s pivotal place in children’s literature and tell the story of Alcott herself—a tale every bit as captivating as her fiction.",
    "image": "https://books.google.com/books/content?id=HfJwBgAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "W. W. Norton & Company",
    "yearPublished": 2015,
    "category": "Fiction",
    "ISBN": "9780393248821",
    "language": "en",
    "pages": 736,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "lKJlAAAAMAAJ",
    "title": "Little Women",
    "authors": [
      "Emma Reeves",
      "Louisa May Alcott"
    ],
    "description": "Chronicles the joys and sorrows of the four March sisters as they grow into young women in nineteenth-century New England. Adapted as a play.",
    "image": "https://books.google.com/books/content?id=lKJlAAAAMAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Oberon Books",
    "yearPublished": 2004,
    "category": "Drama",
    "ISBN": "",
    "language": "en",
    "pages": 120,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "5uvhYIzKpKAC",
    "title": "Little Women",
    "authors": [
      "Louisa May Alcott"
    ],
    "description": "Louisa May Alcott's beloved tale about Meg, Jo, Beth, and Amy is presented in a beautiful Everyman's Library Children's Classics edition. The story of the four sisters' dreams, quarrels, and romances are brought to vivid life in this edition that features full cloth binding in bold, bright colors; silk ribbon marker and headband; two-color illustrated endpapers and illustrations throughout. A brief biography of Alcott is also included.",
    "image": "https://books.google.com/books/content?id=5uvhYIzKpKAC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Everyman's Library",
    "yearPublished": 1994,
    "category": "Young Adult Fiction",
    "ISBN": "9780679436423",
    "language": "en",
    "pages": 550,
    "format": "BOOK",
    "averageRating": 0
  }
]