[
  {
    "googleId": "lhDgrQEACAAJ",
    "title": "Srimad Bhagvad Gita",
    "authors": [
      "Dr Ravi Prakash Arya"
    ],
    "description": "The present translation depicts the Vedic scientific aspect of Srimad Bhagvad Gitaakeeping its spiritual, ethical and philosophical aspect intact without giving any religious colouring which is not at all intended by its narrator, author of script writer. It has been attempted that the basic tenets of Srimad Bhagvad Gita are presented in the most modern suitable terms both for learned and laity. The philosophical concepts like the concept of life, death, rebirth etc. have been elaborated scientifically for the benefit of our readers. Hope the learned readers will find this compendium of Vedic philosophy and science most interesting and useful to determine the future curse of their life to reach their cherished goal on material or spiritual plane.",
    "image": "https://books.google.com/books/content?id=lhDgrQEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Indian Foundation for Vedic Science",
    "yearPublished": 2014,
    "category": "",
    "ISBN": "9788187710578",
    "language": "en",
    "pages": 254,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "zRrWDwAAQBAJ",
    "title": "Bhagvad-Gita",
    "authors": [
      "BS Murthy"
    ],
    "description": "Bhagavad-Gita is the most beautiful, perhaps the only true philosophical song existing in any known tongue’ – so opined William von Humboldt. Though it is a matter of consensus that Bhagvad-Gita in the present length of seven hundred verses has many an interpolation to it, but no meaningful attempt has ever been made to delve into the nature and extent, not to speak of the effect of these on the Hindu society at large. The moot point that has missed the attention of all, all along, is that if the Sudras were to be so lowly in the Lord’s creation, how come then the Gita’s architect Krishna, His avatar, and Vyāsa, its chronicler, happen to be from the same lowly Hindu caste fold. Moreover, is it not absurd to suggest that either or both of them had deprecated the station of their own varna (caste) on their own in their very own Gita? The methodical codification of interpolations carried out here, for the first time ever, puts the true character of Gita in proper perspective. Identified here are hundred and ten slokas of deviant nature and or of partisan character, the source of so much misunderstanding about this book extraordinary, in certain sections of the Hindu fold. Thus, in the long run, exposing and expunging these mischievous insertions is bound to bring in new readers from these quarters to this over two millennia old classic besides altering the misconceptions of the existing adherents. In this modern rendition, the beauty of the Sanskrit slokas is reflected in the rhythmic flow of the English verses of poetic proportions even as the attendant philosophy of the song that is the Gita is captured in contemporary idiom for easy comprehension.",
    "image": "https://books.google.com/books/content?id=zRrWDwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Self Imprint",
    "yearPublished": 2011,
    "category": "Antiques & Collectibles",
    "ISBN": "9788190191104",
    "language": "en",
    "pages": 72,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "XNurEAAAQBAJ",
    "title": "Bhagvad Gita - A Comprehensive Guide in English",
    "authors": [
      "The Divine Edits"
    ],
    "description": "",
    "image": "https://books.google.com/books/content?id=XNurEAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "by Mocktime Publication",
    "yearPublished": 2023,
    "category": "Religion",
    "ISBN": "",
    "language": "en",
    "pages": 57,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "6eySBQAAQBAJ",
    "title": "Srimad Bhagvad Gita",
    "authors": [
      "Manish Chandra Prabhakar"
    ],
    "description": "The Bhagavad Gita is universally renowned as the jewel of India's spiritual wisdom. Spoken by Lord Krishna, the Supreme Personality of Godhead to His intimate disciple Arjuna, the Gita's seven hundred concise verses provide a definitive guide to the science of self realization. No other philosophical or religious work reveals, in such a lucid and profound way, the nature of consciousness, the self, the universe and the Supreme.",
    "image": "https://books.google.com/books/content?id=6eySBQAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Prabhakar Publisher",
    "yearPublished": 2014,
    "category": "",
    "ISBN": "",
    "language": "en",
    "pages": 71,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "zyBMAgAAQBAJ",
    "title": "The Essential Gita",
    "authors": [
      "Group of Mandala Publishing"
    ],
    "description": "In Colour These tiny treasures of metaphysical and mythological knowledge serve as enlightening rubrics for understanding Indian tradition and theology. Exquisitely illustrated, this series serves as a contemporary matrix for illuminating our human experience and offers insightful access into Eastern spirituality. From Gandhi in the East to Emerson and Thoreau in the West, accomplished writers, reformers, poets and intellectuals the world over have turned to the Bhagavad Gita for mystic insight and inspiration. Like the Tao Te Ching or the Dhammapada, its timeless wisdom remains surprisingly fresh and relevant. The Essential Gita culls together some of the most potent verses from this enduring classic, addressing provocative subjects like birth and death, desire, leadership and yoga. From the path of right livelihood to the ocean of unconditional love, the sage advice offered within these pages imparts invaluable teachings on life and how to live it.",
    "image": "https://books.google.com/books/content?id=zyBMAgAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Jaico Publishing House",
    "yearPublished": 2013,
    "category": "Religion",
    "ISBN": "9788184955163",
    "language": "en",
    "pages": 103,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "FgbOwAEACAAJ",
    "title": "Bhagvad Gita",
    "authors": [],
    "description": "\"The Bhagvad Gita occupies an intermediate position between scripture and theology; for it combines the poetical qualities of the first with the clear-cut methodical nature of the second... one of the clearest and most comprehensive summaries of the Perennial Philosophy ever to have been made. Hence its enduring value, not only for India but for all mankind.\" ― Aldous Huxley The Bhagvad Gita (also called the Bhagavad Gita) forms a central part of the Mahabharata, the most popular epic of India. It is also part of the Bhishmaparva. The Mahabharata tells the story of the feud between the sons of Dhrutrashtra (Kauravas) and the sons of Pandu (Pandavas). The Bhagvad Gita itself is a highly philosophical narrative between Krishna and Arjuna on duty, spiritual matters, and the nature of the divine. Arjuna, faced with his duty as a warrior to fight in the war between the Pandavas and Kauravas, is instructed by Krishna to fulfill his Kshatriya (warrior) duty and follow the Dharma. The Bhagvad Gita combines the concept of Dharma with other important teachings such as Sankhya, yoga, bhakti, and detachment from the fruits of action. This version of the Bhagvad Gita is a new translation, and is Raghupati Bhatt's tenth book.",
    "image": "https://books.google.com/books/content?id=FgbOwAEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Manticore Press",
    "yearPublished": 2016,
    "category": "Bhagavadgītā",
    "ISBN": "9780994252586",
    "language": "en",
    "pages": 106,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "gs7A5jOE9C8C",
    "title": "Bhagvad Gita",
    "authors": [
      "Ajai Kumar Srivastava"
    ],
    "description": "At Present We Find Individual Life Miserable And Social Life In Shambles. Problems Of Health, Home And Office Make A Man Miserable. He Finds Life Devoid Of Any Charm And Worth. Evils Like Corruption, Nepotism And Warrism Have Shaken The Very Foundation Of Society.The Message Of The Bhagavadgita Can Change The Situation. It Tells Us That Joy Consists In How Magnificently We Fight The Battle Of Life. Every Individual Has A Unique Mission To Fulfil. Success Lies In Doing Our Best In Whatever Field We Are. They Are Misguided Who Fix Their Gaze On The Outcome, Alone Which Is Governed By Divine Will That Rules The Universe. Arjuna, Who Had Imbibed The Spirit Of The Gita, Had Declared: I Have Made Two Pledges. First, I Shall Never Flee Meek, And Second, I Shall Never Flee Away From The Battle Of Life. Every One Of Us Can Lead A Happy And Contented Life If He Tries To Get Inspiration From The Gita, Irrespective Of The Fact Whether One Believes In God Or Not. The Present Book Shall Convince Him About This Fact. To Read This Book Implies Trying To Open The Closed Doors Of Eternal Happiness.",
    "image": "https://books.google.com/books/content?id=gs7A5jOE9C8C&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Abhinav Publications",
    "yearPublished": 1980,
    "category": "Bhagavadgītā",
    "ISBN": "9788170171133",
    "language": "en",
    "pages": 191,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "qHl2zwEACAAJ",
    "title": "Bhagvad Gita",
    "authors": [
      "Avadhoot Sastry"
    ],
    "description": "The 700-verse Bhagavad Gita is part of the Hindu epic Mahabharata and is a crisp summary of Indian Vedic wisdom. The most renowned and popular Indian scripture describes Hindu religious thinking and yoga terminology. Drawing on older works like the Upanishads, the Gita provides a worldview that is clear, practical, and open to multiple interpretations. The setting for this philosophical exposition is an ancient Indian battlefield, and is a dialogue between the Pandava prince Arjuna and Krishna. Arjuna is concerned the fairness of murdering so many people, some of whom are his friends and family. He voices his misgivings to Krishna, his charioteer and mentor. The essential principles of the Gita are articulated in Krishna's response. Krishna's argument contains much of the primary ideas in other classic spiritual texts, and emphasises the dualism of soul and matter. One can murder only the body; the eternal soul transmigrates into another body at death or achieves liberation (moksha) or extinction (nirvana), escape from the circle of rebirth.",
    "image": "https://books.google.com/books/content?id=qHl2zwEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2022,
    "category": "",
    "ISBN": "9789356617629",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "Z7e3brePvrIC",
    "title": "In Search of Oneness",
    "authors": [
      "Moosa Raza"
    ],
    "description": "This free-flowing narrative illuminates the journey of the author, a devout Muslim, through sacred books and holy men of all religions---starting with his own---in search of a personal god and faith, and his coming upon the Bhagavad Gītā. Examining commentaries on this text, from Sankara to Abdur Rahman Chishti, alongside some renderings of the Quran here, Moosa Raza finds many common threads: summoning God through sādhanā or dhikr; reaching God through daan or giving and the service of the destitute; and seeking ecstasy through self-mastery, detachment and surrender. These original observations are complemented by his encounters with people practising these values, like his ailing school teacher who felt God was always behind him or his friend, a senior civil servant, who, trusting in Allah’s providence, kept an open home for the poor and the homeless. Through these experiences and his own striving, Raza celebrates the oneness and power of faith and spirituality, showing a path for other seekers.",
    "image": "https://books.google.com/books/content?id=Z7e3brePvrIC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Penguin UK",
    "yearPublished": 2012,
    "category": "Body, Mind & Spirit",
    "ISBN": "9788184756722",
    "language": "en",
    "pages": 256,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "Uzt7EAAAQBAJ",
    "title": "(Free Sample) Bhagvad Gita - The Story Way for Students & Parents",
    "authors": [
      "Avinash Agarwal"
    ],
    "description": "Bhagvad Gita, the essence of all spiritual knowledge, offers an unbiased perspective of major truths of life as well as of the universe. But most of the readers are quite apprehensive in picking up the Gita, as it encompasses a mammoth reading with meanings hard to grasp and even more difficult to implement. This book is a humble attempt at simplifying the profound knowledge contained in it. The book explains the key lessons of Bhagvad Gita with the help of stories, anecdotes and real life experiences. To make it further relevant and easy to implement for students, each lesson is followed by Student takeaways and Point to ponder. Additionally, the book aims at instilling the spirit of courage, determination and hard work in readers so that they can take on the challenges of life head-on; and, be thankful to the mentors who helped them on their way to success.",
    "image": "https://books.google.com/books/content?id=Uzt7EAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Disha Publications",
    "yearPublished": 2022,
    "category": "",
    "ISBN": "",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 0
  }
]