[
  {
    "googleId": "sxVHDwAAQBAJ",
    "title": "12 Rules for Life",
    "authors": [
      "Jordan B. Peterson"
    ],
    "description": "#1 NATIONAL BESTSELLER #1 INTERNATIONAL BESTSELLER What does everyone in the modern world need to know? Renowned psychologist Jordan B. Peterson's answer to this most difficult of questions uniquely combines the hard-won truths of ancient tradition with the stunning revelations of cutting-edge scientific research. Humorous, surprising and informative, Dr. Peterson tells us why skateboarding boys and girls must be left alone, what terrible fate awaits those who criticize too easily, and why you should always pet a cat when you meet one on the street. What does the nervous system of the lowly lobster have to tell us about standing up straight (with our shoulders back) and about success in life? Why did ancient Egyptians worship the capacity to pay careful attention as the highest of gods? What dreadful paths do people tread when they become resentful, arrogant and vengeful? Dr. Peterson journeys broadly, discussing discipline, freedom, adventure and responsibility, distilling the world's wisdom into 12 practical and profound rules for life. 12 Rules for Life shatters the modern commonplaces of science, faith and human nature, while transforming and ennobling the mind and spirit of its readers.",
    "image": "https://books.google.com/books/content?id=sxVHDwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Random House Canada",
    "yearPublished": 2018,
    "category": "Psychology",
    "ISBN": "9780345816023",
    "language": "en",
    "pages": 450,
    "format": "BOOK",
    "averageRating": 4.5
  },
  {
    "googleId": "Aa1FzgEACAAJ",
    "title": "Workbook for 12 Rules for Life",
    "authors": [],
    "description": "Complete beginners can begin using this workbook for 12 Rules for Life: An Antidote to Chaos by Jordan B. Peterson to find immediate help in applying its major lessons. 12 Rules for Life, Jordan Peterson's latest book, gives us twelve essential rules to help us improve our lives and learn more about ourselves and the world around us. Peterson applies his modern knowledge of psychology and neurology to several classical stories to explain his ideas and concepts and provide his readers with a wonderful and valuable self-help guide. 12 Rules for Life was ranked not only the best-selling book in the United States on Amazon, but also number one in Canada and number four in the United Kingdom as well. Certainly, a book that should not be overlooked by all who wish to ponder the reasons why human beings are who they are and do what they do. Who wouldn’t want to continue applying the best thought topics found in some of today’s most important books? The goal of this workbook is to help even the newest readers apply what may be the most critical lessons found in 12 Rules for Life: An Antidote to Chaos by Jordan B. Peterson. Results have shown that learning is retained best through repeated hands-on applications. With Max Help Workbooks, readers will be able to find distilled information categorized into major lessons with applicable exercise worksheets to maximize learning. With each chapter, there are questions devoted both to self or group study usage with actionable steps to stimulate engagement: Don’t Miss the Following Features: • Succinct breakdown of the book categorized into major lessons • Easy-to-understand analysis of each lesson distilled for even the newest of readers • Simple and practical worksheets to further reader’s application • Quiz questions as a resource to be used for yourself or others • Extra: Bonus downloads available in every purchase! So, what are you waiting for? Get your copy now and take out a pencil, pen, or whatever digital technology to jot down, implement, and make solid changes happen. And don’t forget to have fun - that’ll also keep you learning. Disclaimer: This unofficial workbook is for readers for further application as a companion guide of the original work and is not intended to replace or substitute the original work in any way. We encourage readers to purchase the original work prior to purchasing this copy to obtain the Max Help possible.",
    "image": "https://books.google.com/books/content?id=Aa1FzgEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2018,
    "category": "Conduct of life",
    "ISBN": "9788829507511",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "ohB5DwAAQBAJ",
    "title": "Summary of 12 Rules for Life",
    "authors": [
      "SpeedyReads"
    ],
    "description": "Human being does not like rules in general despite knowing that they benefit us. We do not want a lot of rules. However, without rules, we are likely to lose a sense of direction and go wayward. Therefore, we need rules. Here is a preview of what you'll learn: Rule 1 - Stand up Straight with Your Shoulders Back Rule 2- Treat Yourself Like Someone You Are Responsible for Helping Rule 3- Make Friends with People Who Want the Best for You Rule 4- Compare Yourself to Who You Were Yesterday, Not To Who Someone Else Is Today Rule 5- Do Not Let Your Children Do Anything That Makes You Dislike Them Rule 6- Set Your House in Perfect Order Before You Criticize the World Rule 7- Pursue what is Meaningful (Not what is Expedient) Rule 8- Tell the Truth- or At Least, Don't Lie Rule 9- Assume That The Person You Are Listening To Might Know Something You Don't Rule 10- Be Precise in Your Speech Rule 11- Do Not Bother Children When They Are Skateboarding Rule 12- Pet a Cat When You Encounter One on the Street",
    "image": "https://books.google.com/books/content?id=ohB5DwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Gatsby",
    "yearPublished": 2018,
    "category": "Philosophy",
    "ISBN": "9783965087590",
    "language": "en",
    "pages": 46,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "q5aSzwEACAAJ",
    "title": "12 Rules for Life",
    "authors": [
      "Jordan B. Peterson",
      "Ellis Goodman"
    ],
    "description": "What do you think are the most important facts that everybody should be aware of? Jordan Peterson, a renowned clinical psychologist who has shaped the modern understanding of personality, has emerged as one of the world's most popular public thinkers, with his lectures attracting tens of millions of viewers. His lecture topics range from the Bible and romantic relationships to mythology. His straightforward and invigorating message on the need of personal responsibility and ancient wisdom has resounded all around the world at an era of extraordinary upheaval and divided politics. His twelve principles for a fulfilling existence range from \"putting one's own house in order\" to \"judging oneself by what one was yesterday, rather than what one is today.\" He demonstrates why seeking happiness is fruitless. Instead, we must seek significance not as an end in itself but as a means of protecting ourselves from the inevitable pain of living. A deeply rewarding antidote to the chaos in our lives, 12 Rules for Life applies eternal truths to our modern problems with the help of vivid examples from the author's clinical practice and personal life as well as the latest in psychology and philosophy and the wisdom of humanity's oldest myths and stories.",
    "image": "https://books.google.com/books/content?id=q5aSzwEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2022,
    "category": "",
    "ISBN": "9781387429448",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "_aTJDwAAQBAJ",
    "title": "Summary of 12 Rules for Life by Jordan B. Peterson",
    "authors": [
      "QuickRead",
      "Alyssa Burnette"
    ],
    "description": "Advertised as an antidote to chaos, 12 Rules for Life (2018) assesses humanity’s most pressing concerns through the ages and compiles their solutions in this handy self-help book. Drawing on psychology, religion, philosophy, literature, and personal experience, author Jordan B. Peterson seeks to eliminate life’s chaos and confusion through the compilation of 12 simple rules that address the deepest questions of humanity. Challenging such questions as, “Why do bad things happen to good people?” and “Why isn’t life fair?” Peterson crafts a solution to truly living our best lives through adherence to his twelve consistent principles. Do you want more free books like this? Download our app for free at https://www.QuickRead.com/App and get access to hundreds of free book and audiobook summaries. DISCLAIMER: This book summary is meant as a preview and not a replacement for the original work. If you like this summary please consider purchasing the original book to get the full experience as the original author intended it to be. If you are the original author of any book on QuickRead and want us to remove it, please contact us at hello@quickread.com.",
    "image": "https://books.google.com/books/content?id=_aTJDwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "QuickRead.com",
    "yearPublished": null,
    "category": "Study Aids",
    "ISBN": "",
    "language": "en",
    "pages": 26,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "I1oJEAAAQBAJ",
    "title": "Beyond Order",
    "authors": [
      "Jordan B. Peterson"
    ],
    "description": "The companion volume to 12 Rules for Life offers further guidance on the perilous path of modern life. In 12 Rules for Life, clinical psychologist and celebrated professor at Harvard and the University of Toronto Dr. Jordan B. Peterson helped millions of readers impose order on the chaos of their lives. Now, in this bold sequel, Peterson delivers twelve more lifesaving principles for resisting the exhausting toll that our desire to order the world inevitably takes. In a time when the human will increasingly imposes itself over every sphere of life—from our social structures to our emotional states—Peterson warns that too much security is dangerous. What’s more, he offers strategies for overcoming the cultural, scientific, and psychological forces causing us to tend toward tyranny, and teaches us how to rely instead on our instinct to find meaning and purpose, even—and especially—when we find ourselves powerless. While chaos, in excess, threatens us with instability and anxiety, unchecked order can petrify us into submission. Beyond Order provides a call to balance these two fundamental principles of reality itself, and guides us along the straight and narrow path that divides them.",
    "image": "https://books.google.com/books/content?id=I1oJEAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Penguin",
    "yearPublished": 2021,
    "category": "Self-Help",
    "ISBN": "9780593084656",
    "language": "en",
    "pages": 432,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "bLVJvQEACAAJ",
    "title": "Workbook for 12 Rules for Life: An Antidote to Chaos (Max Help Workbooks)",
    "authors": [
      "Maxhelp Workbooks"
    ],
    "description": "Complete beginners can use this workbook for 12 Rules for Life: An Antidote to Chaos by Jordan B. Peterson and find immediate help in applying its major lessons. 12 Rules for Life, Jordan Peterson's latest book, gives us twelve essential rules to help us improve our lives and learn more about ourselves and the world around us. Peterson applies his modern knowledge of psychology and neurology to several classical stories to explain his ideas and concepts and provide his readers with a wonderful and valuable self-help guide. 12 Rules for Life was ranked not only the best-selling book in the United States on Amazon, but also number one in Canada and number four in the United Kingdom as well. Certainly, a book that should not be overlooked by all who wish to ponder the reasons why human beings are who they are and do what they do. Do you want to apply the major lessons to your daily life? The goal of this workbook is to help even the newest readers apply what may be the most critical lessons found in 12 Rules for Life: An Antidote to Chaos by Jordan B. Peterson. Results have shown that learning is retained best through repeated hands-on applications. With Max Help Workbooks, readers will be able to find distilled information categorized into major lessons with applicable exercise worksheets to maximize learning. Don't Miss the Following Content: - Succinct breakdown of the book categorized into major lessons - Read and use the exercises yourself or as a group - Easy-to-understand analysis of each lessons distilled for even the newest of readers - Simple and practical worksheets to further reader's application - Quiz questions as a resource to be used for yourself or others So, what are you waiting for? Get your copy now and take out a pencil, pen, or whatever digital technology to jot down, implement, and make solid changes happen. And don't forget to have fun - that'll also keep you learning. Disclaimer: This workbook is meant to further application",
    "image": "https://books.google.com/books/content?id=bLVJvQEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Blurb",
    "yearPublished": 2018,
    "category": "Reference",
    "ISBN": "9780464720591",
    "language": "en",
    "pages": 60,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "fgdGEAAAQBAJ",
    "title": "Illustration of 12 Rules For Life",
    "authors": [
      "Fast Short Reads"
    ],
    "description": "A summary of the book and a review of 12 Rules For Life 1. Maintain a straight posture with your shoulders pushed back. 2. Treat yourself as though you were a person in need of assistance. 3. Make friends with folks who genuinely care about your well-being. 4. Evaluate yourself in relation to who you were yesterday, not to who another person is today. 5. Avoid allowing your children to do anything that makes you dislike them. 6. Prior to criticizing the world, get your own house in order. 7. Strive for what is meaningful rather than what is expedient 8. Tell the truth or, at the very least, avoid lying 9. Use exact language in your discourse. 10. Assume the person you are listening to is aware of something you are unaware of. 11. Avoid obstructing children while skateboardinginhlg 12. Pet a cat if you happen to come across one on the street. Allow yourself to be enchanted by pockets of light. dividing rules for 1-12 it is okay to break the rules how many table tennis rules are there what are the ratings and certificates for breakout when was rafferty's rules created when was break the rules created 12 rules for life pdf 12 rules for life jordan peterson 12 rules for life summary 12 rules for life audiobook 12 rules for life review 12 rules for life book 12 rules for life jordan peterson pdf 12 rules for life list 12 rules for life peterson 12 rules for life amazon 12 rules for life summarized 12 rules for life an antidote to chaos 12 rules for life 12 rules for life summary 12 rules for life audiobook 12 rules for life an antidote to chaos 12 rules for life list 12 rules for life review 12 rules for life chapters 12 rules for life barnes and noble 12 rules for life amazon 12 rules for life poster",
    "image": "https://books.google.com/books/content?id=fgdGEAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Fast Short Reads",
    "yearPublished": null,
    "category": "Fiction",
    "ISBN": "",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "cuh4DwAAQBAJ",
    "title": "Summary of 12 Rules for Life: An Antidote to Chaos by Jordan B. Peterson + Summary of Dark Money by Jane Mayer 2-in-1 Boxset Bundle",
    "authors": [
      "SpeedyReads"
    ],
    "description": "Wanna Read But Not Enough Time? Then, grab a SpeedyReads of Summary of 12 Rules for Life: An Antidote to Chaos by Jordan B. Peterson and Summary of Dark Money by Jane Mayer Now! This is a 2-in-1 Boxset Bundle! Download And Start Reading Now - Even if it's 3 AM! Hurry, Limited Quantities Available! *Bonus Section Included* 100% Satisfaction Guaranteed or your money back!",
    "image": "https://books.google.com/books/content?id=cuh4DwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Gatsby",
    "yearPublished": 2018,
    "category": "Young Adult Nonfiction",
    "ISBN": "9783965084889",
    "language": "en",
    "pages": 84,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "XDR8zgEACAAJ",
    "title": "Summary of 12 Rules for Life",
    "authors": [
      "T. O. M. JAMES"
    ],
    "description": "On the off chance that you have been searching for a counteractant to the occasionally strange disorder throughout everyday life, at that point look no further! The book \"12 Rules for Life: An Antidote to Chaos\" by Jordan B. Peterson gives us the important bits of knowledge into the powers we know as Order and Chaos. Request addresses design, information and sureness, while Chaos represents conceivable outcomes, the obscure and some of the time rebellion. One can't exist without the other and we are the ones who should attempt to figure out both throughout everyday life. The 12 Rules listed in the book are only the comprehensive outline needed for somebody to figure out request and tumult, yet to accept it in regular living and cultivate your advancement into a superior individual. The Rules will lead you to look profound and consider how you are really ready to defeat constraints and become somebody with a seriously fulfilling and significant life. This book holds an itemized, far reaching outline of the original book by Jordan Peterson and it concisely groups every one of the significant points into simple to-recollect focuses for speedy and compelling comprehension of the original book, so you can get down to business and begin to see the advantages from 12 Rules for Life in the most brief conceivable time! This book is intended to supplement the first book and unquestionably not to replace it. Inside the book, you will discover Synopses of Each Chapter Chief Summary of The Book Significant Facts and Deliverables Condensed Into Key Knowledge Pointers This synopsis is presently accessible in soft cover, perceptible sound, and fuel versions. click on Buy Now Button To Get Started Disclaimer: This is an outline, summary \"12 Rules forever: An Antidote to Chaos\" and not the original book.",
    "image": "https://books.google.com/books/content?id=XDR8zgEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2021,
    "category": "",
    "ISBN": "9798505006092",
    "language": "en",
    "pages": 114,
    "format": "BOOK",
    "averageRating": 0
  }
]