[
  {
    "googleId": "WJiqAGsX30cC",
    "title": "The Namesake",
    "authors": [
      "Jhumpa Lahiri"
    ],
    "description": "A young man born of Indian parents in America struggles with issues of identity from his teens to his thirties.",
    "image": "https://books.google.com/books/content?id=WJiqAGsX30cC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Houghton Mifflin Harcourt",
    "yearPublished": 2003,
    "category": "Fiction",
    "ISBN": "9780395927212",
    "language": "en",
    "pages": 308,
    "format": "BOOK",
    "averageRating": 4.5
  },
  {
    "googleId": "MBvsDQAAQBAJ",
    "title": "The Namesake",
    "authors": [
      "Steven Parlato"
    ],
    "description": "Gifted artist? Standout student? All his teachers are sure certain that Evan Galloway can be the graduate who brings glory to small, ordinary St. Sebastian's School. As for Evan, however, he can't be bothered anymore. Since the shock of his young father's suicide last spring, Evan no longer cares about the future. In fact, he believes that he spent the first fifteen years of his life living a lie. Despite his mother's encouragement and the steadfast companionship of his best friend, Alexis, Evan is mired in rage and bitterness. Good memories seem ludicrous when the present holds no hope. Then Evan's grandmother hands him the key--literally, a key--to a locked trunk that his father hid when he was the same age as Evan is now. Digging into the trunk and the small-town secrets it uncovers, Evan can begin to face who his father really was, and why even the love of his son could not save him. In a voice that resonates with the authenticity of grief, Steven Parlato tells a different kind of coming-of-age story, about a boy thrust into adulthood too soon, through the corridor of shame, disbelief, and finally...compassion.",
    "image": "https://books.google.com/books/content?id=MBvsDQAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Simon and Schuster",
    "yearPublished": 2012,
    "category": "Young Adult Fiction",
    "ISBN": "9781440554582",
    "language": "en",
    "pages": 288,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "U7_fGwAACAAJ",
    "title": "The Namesake",
    "authors": [
      "Jhumpa Lahiri"
    ],
    "description": "For use in schools and libraries only. A portrait of the immigrant experience follows the Ganguli family from their traditional life in India through their arrival in Massachusetts in the late 1960s and their difficult melding into an American way of life.",
    "image": "https://books.google.com/books/content?id=U7_fGwAACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2004,
    "category": "Alienation (Social psychology)",
    "ISBN": "9781417647859",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "O46DxAEACAAJ",
    "title": "The Namesake",
    "authors": [
      "Jhumpa Lahiri"
    ],
    "description": "",
    "image": "https://books.google.com/books/content?id=O46DxAEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2003,
    "category": "",
    "ISBN": "9780605035591",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "1PghPQAACAAJ",
    "title": "The Namesake",
    "authors": [
      "Marilyn Herbert"
    ],
    "description": "The Namesake tells the story of a newly married couple, Ashoke and Ashima Ganguli, who emigrate to the United States from India. Not long after they arrive, their first child, a son, is born and there is an immediate clash of cultures. In the Bengali tradition, the ritual of naming a baby can take up to 41 days after birth. But in America, bureaucracy demands that the baby not be released from hospital without a name on his birth certificate. Luckily, Indian tradition allows for a pet or nickname to be chosen and, oddly, the parents choose the name Gogol after the Russian writer, Nikolai Gogol. The result of a name that connects him to neither his American birth nor his Indian heritage is a search for personal identity. This novel has been made into a wonderful film with the same name from director, Mira Nair. The guide to Lahiri’s novel includes information on the following: Why is the namesake of an American-born child with Bengali roots a famous, but disturbed, Russian author? How do our names impact on who we are and who we become? What is the impact of immigration on both parents and children? How do Lahiri's skills as a short-story writer influence her presentation of the story? Every Bookclub-in-a-Box discussion guide includes complete coverage of the themes and symbols, writing style and interesting background information on the novel and the author.",
    "image": "https://books.google.com/books/content?id=1PghPQAACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Bookclub in a Box",
    "yearPublished": 2007,
    "category": "Education",
    "ISBN": "9781897082393",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 5
  },
  {
    "googleId": "iK5z-72DKqEC",
    "title": "The Namesake",
    "authors": [
      "Conor Fitzgerald"
    ],
    "description": "When it comes to murder it's all in a nameWhen magistrate Matteo Arconti's namesake, an insurance man from Milan, is found dead outside the court buildings in Piazzale Clodio, it's a coded warning to the authorities - a clear message of defiance and intimidation.Commissioner Alec Blume, all too familiar with Rome's criminal underclass, knows little of the Calabrian mafia currently under investigation by the magistrate. Handing control of the murder inquiry to his now live-in and not-so-secret partner Caterina Mattiola, Blume takes a back seat. But while Caterina questions the dead man's widow, Blume has an underhand idea of his own to lure the arrogant mafioso out of his hiding place...",
    "image": "https://books.google.com/books/content?id=iK5z-72DKqEC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "A&C Black",
    "yearPublished": 2013,
    "category": "Fiction",
    "ISBN": "9781408831564",
    "language": "en",
    "pages": 369,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "v5qpDAAAQBAJ",
    "title": "A Study Guide for Jhumpa Lahiri's \"The Namesake\"",
    "authors": [
      "Gale, Cengage Learning"
    ],
    "description": "A Study Guide for Jhumpa Lahiri's \"The Namesake,\" excerpted from Gale's acclaimed Novels for Students. This concise study guide includes plot summary; character analysis; author biography; study questions; historical context; suggestions for further reading; and much more. For any literature project, trust Novels for Students for all of your research needs.",
    "image": "https://books.google.com/books/content?id=v5qpDAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Gale Cengage Learning",
    "yearPublished": 2016,
    "category": "Literary Criticism",
    "ISBN": "9781410353597",
    "language": "en",
    "pages": 35,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "NtAcOQAACAAJ",
    "title": "The Namesake",
    "authors": [
      "Willa Cather"
    ],
    "description": "Willa Sibert Cather (1873-1947) was an eminent American author. She spent her childhood in Red Cloud, Nebraska, the same town that has been made famous by her writing. She insisted on attending college, so her family borrowed money so she could enroll at the University of Nebraska-Lincoln. While there, she became a regular contributor to the Nebraska State Journal. She then moved to Pittsburgh, where she taught high school English and worked for Home Monthly, and eventually got a job offer from McClure's Magazine in New York City. Later, she became the managing editor in 1908. The latter publication serialized her first novel, Alexander's Bridge (1912), which was heavily influenced by Henry James. For her novels she returned to the prairie for inspiration, and these works became popular and critical successes. She won the Pulitzer Prize in 1923 for One of Ours (1922). Her other works include: O Pioneers! (1913), The Song of the Lark (1915), My Antonia (1918) and A Lost Lady (1923).",
    "image": "https://books.google.com/books/content?id=NtAcOQAACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2008,
    "category": "Fiction",
    "ISBN": "9781409908838",
    "language": "en",
    "pages": 48,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "R60FEQAAQBAJ",
    "title": "THE NAMESAKE",
    "authors": [
      "Narayan Changder"
    ],
    "description": "THE NAMESAKE MCQ (MULTIPLE CHOICE QUESTIONS) SERVES AS A VALUABLE RESOURCE FOR INDIVIDUALS AIMING TO DEEPEN THEIR UNDERSTANDING OF VARIOUS COMPETITIVE EXAMS, CLASS TESTS, QUIZ COMPETITIONS, AND SIMILAR ASSESSMENTS. WITH ITS EXTENSIVE COLLECTION OF MCQS, THIS BOOK EMPOWERS YOU TO ASSESS YOUR GRASP OF THE SUBJECT MATTER AND YOUR PROFICIENCY LEVEL. BY ENGAGING WITH THESE MULTIPLE-CHOICE QUESTIONS, YOU CAN IMPROVE YOUR KNOWLEDGE OF THE SUBJECT, IDENTIFY AREAS FOR IMPROVEMENT, AND LAY A SOLID FOUNDATION. DIVE INTO THE NAMESAKE MCQ TO EXPAND YOUR THE NAMESAKE KNOWLEDGE AND EXCEL IN QUIZ COMPETITIONS, ACADEMIC STUDIES, OR PROFESSIONAL ENDEAVORS. THE ANSWERS TO THE QUESTIONS ARE PROVIDED AT THE END OF EACH PAGE, MAKING IT EASY FOR PARTICIPANTS TO VERIFY THEIR ANSWERS AND PREPARE EFFECTIVELY.",
    "image": "https://books.google.com/books/content?id=R60FEQAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "CHANGDER OUTLINE",
    "yearPublished": 2024,
    "category": "Fiction",
    "ISBN": "",
    "language": "en",
    "pages": 31,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "F3UFOAAACAAJ",
    "title": "The Namesake ...",
    "authors": [
      "Willa Cather"
    ],
    "description": "",
    "image": "https://books.google.com/books/content?id=F3UFOAAACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 1907,
    "category": "",
    "ISBN": "",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 0
  }
]