[
  {
    "googleId": "l2tgn7DGaP4C",
    "title": "Never Let Me Go",
    "authors": [
      "Kazuo Ishiguro"
    ],
    "description": "NOBEL PRIZE WINNER • The moving, suspenseful, beautifully atmospheric modern classic from the acclaimed author of The Remains of the Day and Klara and the Sun—“a Gothic tour de force\" (The New York Times) with an extraordinary twist. “Brilliantly executed.” —Margaret Atwood “A page-turner and a heartbreaker.” —TIME “Masterly.” —Sunday Times As children, Kathy, Ruth, and Tommy were students at Hailsham, an exclusive boarding school secluded in the English countryside. It was a place of mercurial cliques and mysterious rules where teachers were constantly reminding their charges of how special they were. Now, years later, Kathy is a young woman. Ruth and Tommy have reentered her life. And for the first time she is beginning to look back at their shared past and understand just what it is that makes them special—and how that gift will shape the rest of their time together.",
    "image": "https://books.google.com/books/content?id=l2tgn7DGaP4C&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Vintage Canada",
    "yearPublished": 2010,
    "category": "Fiction",
    "ISBN": "9780307400994",
    "language": "en",
    "pages": 305,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "0Iq8F_TMa7QC",
    "title": "Never Let Me Go (Screenplay)",
    "authors": [
      "Alex Garland"
    ],
    "description": "In his highly acclaimed novel Never Let Me Go, Kazuo Ishiguro ( The Remains of the Day) created a remarkable story of love, loss and hidden truths. In it he posed the fundamental question: What makes us human? Now director Mark Romanek ( One Hour Photo), writer Alex Garland and DNA Films bring Ishiguro's hauntingly poignant and emotional story to the screen. Kathy (Oscar nominee Carey Mulligan, An Education), Tommy ( Andrew Garfield, Boy A, Red Riding) and Ruth (Oscar nominee Keira Knightley, Pride & Prejudice, Atonement) live in a world and a time that feel familiar to us, but are not quite like anything we know. They spend their childhood at Hailsham, a seemingly idyllic English boarding school. When they leave the shelter of the school and the terrible truth of their fate is revealed to them, they must also confront the deep feelings of love, jealousy and betrayal that threaten to pull them apart.",
    "image": "https://books.google.com/books/content?id=0Iq8F_TMa7QC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Faber & Faber",
    "yearPublished": 2011,
    "category": "Performing Arts",
    "ISBN": "9780571275496",
    "language": "en",
    "pages": 130,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "7O4UMwEACAAJ",
    "title": "Never Let Me Go",
    "authors": [
      "Gale Wilhelm"
    ],
    "description": "",
    "image": "https://books.google.com/books/content?id=7O4UMwEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 1947,
    "category": "",
    "ISBN": "",
    "language": "en",
    "pages": 232,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "sJiOEAAAQBAJ",
    "title": "Never Let Me Go",
    "authors": [
      "Kazuo Ishiguro"
    ],
    "description": "A beautiful hardcover edition of one of the Nobel Prize-winning author's most acclaimed novels: a deeply moving and stunningly original love story with a startling twist As children, Kathy, Ruth, and Tommy were students at Hailsham, an exclusive boarding school secluded in the English countryside. It was a place of mercurial cliques and mysterious rules where teachers were constantly reminding their charges of how special they were. Now, years later, Kathy is a young woman. Ruth and Tommy have reentered her life. And for the first time she is beginning to look back at their shared past and understand just what it is that makes them special—and how that gift will shape the rest of their time together.",
    "image": "https://books.google.com/books/content?id=sJiOEAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "National Geographic Books",
    "yearPublished": 2023,
    "category": "Fiction",
    "ISBN": "9780593536551",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "PQaqDQAAQBAJ",
    "title": "Never Let Me Go",
    "authors": [
      "Kazuo Ishiguro"
    ],
    "description": "Designed to meet the requirements for students at GCSE and A level, this accessible educational edition offers the complete text of Never Let Me Go with a comprehensive study guide. Intended for individual study as well as class use, Geoff Barton's guide: - clearly introduces the context of the novel and its author;- examines in detail its themes, characters and structure;- looks at the novel in the author's own words, and at different critical receptions;- provides glossaries and test questions to prompt deeper thinking. In one of the most memorable novels of recent years, Kazuo Ishiguro imagines the lives of a group of students growing up in a darkly skewed version of contemporary England. Narrated by Kathy, now thirty-one, Never Let Me Go hauntingly dramatises her attempts to come to terms with her childhood at a seemingly idyllic school, Hailsham, and with the fate that has always awaited her and her closest friends in the wider world. A story of love, friendship and memory, Never Let Me Go is charged throughout with a sense of the fragility of life.",
    "image": "https://books.google.com/books/content?id=PQaqDQAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Faber & Faber",
    "yearPublished": 2017,
    "category": "Fiction",
    "ISBN": "9780571335787",
    "language": "en",
    "pages": 387,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "gcl0DwAAQBAJ",
    "title": "Never Let Me Go by Kazuo Ishiguro (Book Analysis)",
    "authors": [
      "Bright Summaries"
    ],
    "description": "Unlock the more straightforward side of Never Let Me Go with this concise and insightful summary and analysis! This engaging summary presents an analysis of Never Let Me Go by Kazuo Ishiguro, a dystopian novel set in a fictionalised version of England where human clones are used for organ donation. The novel follows three of these clones, Kathy, Ruth and Tommy, as they grow up and come to realise that they have no way of escaping their fate, which will inevitably lead to their early deaths. In this way, the author reflects on mortality, the ethical limits of modern science and what it means to be human. Never Let Me Go is Kazuo Ishiguro’s sixth novel and, along with The Remains of the Day (for which he won the Man Booker Prize in 1989) and The Buried Giant, is one of his most widely read works. Find out everything you need to know about Never Let Me Go in a fraction of the time! This in-depth and informative reading guide brings you: • A complete plot summary • Character studies • Key themes and symbols • Questions for further reflection Why choose BrightSummaries.com? Available in print and digital format, our publications are designed to accompany you on your reading journey. The clear and concise style makes for easy understanding, providing the perfect opportunity to improve your literary knowledge in no time. See the very best of literature in a whole new light with BrightSummaries.com!",
    "image": "https://books.google.com/books/content?id=gcl0DwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "BrightSummaries.com",
    "yearPublished": 2018,
    "category": "Literary Criticism",
    "ISBN": "9782808012638",
    "language": "en",
    "pages": 19,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "lvXetAEACAAJ",
    "title": "Never Let Me Go",
    "authors": [
      "Roxy Love"
    ],
    "description": "~Isabella~He found me. Just when everything was starting to go great in my life, my nightmare came back to haunt me. My heart is broken. Is it possible that Tony has changed for the better? Or am I fooling myself? What lies ahead for Nick and I?~Tony~I've finally found her. Nothing is ever easy. She doesn't trust me and has the hots for the guy next door. Well she is mine, like it or not. I will do whatever it takes to keep her where she belongs. With me.~Nick~I can't believe I trusted her. I let myself fall for her and hard. Only to find out she is married! Yet somehow, something about that situation doesn't seem right. I don't like Tony, and I don't trust him. And to top it off, my best friend is in the hospital. My life is spinning out of control. Somehow, I will find a way to make things right. This is the second book in a 2 book series. Never Letting Go, Secrets and Lies, Book 1 should be read before this one.",
    "image": "https://books.google.com/books/content?id=lvXetAEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Independently Published",
    "yearPublished": 2017,
    "category": "",
    "ISBN": "9781973508915",
    "language": "en",
    "pages": 194,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "c2DhCwAAQBAJ",
    "title": "Never Let You Go",
    "authors": [
      "Monica Murphy"
    ],
    "description": "The second novel in this darkly sexy contemporary series from bestselling author Monica Murphy wraps up an emotionally powerful two-part tale of forbidden love. The truth hurts, they say—and my pain cuts deep. While I was falling for Ethan, he was deceiving me the entire time. He held a huge secret, protected by his lies. When I discovered what he was hiding, the truth shook my world, threatening to ruin us forever. Ruin me. But I soon realized that what we share can’t be destroyed. The connection between us is too strong. It always has been. I can’t deny him any longer. And I can’t deny my truth: I’m in love with Ethan. I don’t want to let him go. While we’re trying our best to make this relationship work, other forces are fighting against us. My family, who wants to keep me safe. The media obsessed with my tragic past. The public that feeds off of it. Even Ethan’s father—the man who nearly destroyed me all those years ago. He’s doing his best to finish the job. Despite my love for Ethan, the doubts creep in, clouding my mind. Is he worth the pain? Will our love survive, or will we have no choice but to end it—end us—once and for all? Praise for Never Let You Go “As a reader, this relationship shouldn’t work even though it has to work. It’s only because of Ms. Murphy’s skill in delicately addressing survival from sexual assault and abuse that we find the capacity to heal through touch and love.”—Heroes and Heartbreakers “Much like the first book, this story was an emotional roller-coaster ride that never really let up. But that’s what made the story so fantastic and engaging.”—Emilie’s Book World “A story that will grip you, pull you in, and keep you immersed til the end . . . an emotional and sweet story that will stay with me for years to come.”—Read-Love-Blog “A dramatic and beautiful and frightening story.”—Fictional Candy “Murphy nailed it with this one for sure. . . . Katherine and Ethan. Katie and Will. They are such a dynamic couple. Everything they have been through makes their bond tight.”—Mommy’s a Book Whore Praise for Monica Murphy’s Never Tear Us Apart “All the best parts of romance and betrayal . . . I couldn’t turn the pages fast enough.”—New York Times bestselling author Jay Crownover “A powerful story that left me raw yet hopeful.”—USA Today bestselling author K. A. Tucker “A powerful story of friendship, trauma, coping and betrayal. The characters jump off the page into real life and will have readers gasping and feeling every emotion that they go through. Another amazing book to add to Murphy’s already stellar library!”—RT Book Reviews (4 1/2 stars) “Murphy has written a compelling and emotional love story of two severely broken people, each of whom can be healed only by the other.”—Booklist “Murphy imbues these characters with genuineness and plausibility. . . . [Readers] will look forward to the promised sequel.”—Publishers Weekly",
    "image": "https://books.google.com/books/content?id=c2DhCwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Bantam",
    "yearPublished": 2016,
    "category": "Fiction",
    "ISBN": "9781101967300",
    "language": "en",
    "pages": 369,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "PFB7CwAAQBAJ",
    "title": "Never Let Me",
    "authors": [
      "Jennifer Brozek"
    ],
    "description": "\"This special edition features the first three books in Jennifer Brozek's Melissa Allen series: Never Let Me Sleep, Never Let Me Leave, Never Let Me Die as well as a previously unpublished short story, Never Let Me Feel\"--Back cover.",
    "image": "https://books.google.com/books/content?id=PFB7CwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Simon and Schuster",
    "yearPublished": 2016,
    "category": "Fiction",
    "ISBN": "9781618686268",
    "language": "en",
    "pages": 496,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "googleId": "wF8NEQAAQBAJ",
    "title": "NEVER LET ME GO",
    "authors": [
      "Narayan Changder"
    ],
    "description": "THE NEVER LET ME GO MCQ (MULTIPLE CHOICE QUESTIONS) SERVES AS A VALUABLE RESOURCE FOR INDIVIDUALS AIMING TO DEEPEN THEIR UNDERSTANDING OF VARIOUS COMPETITIVE EXAMS, CLASS TESTS, QUIZ COMPETITIONS, AND SIMILAR ASSESSMENTS. WITH ITS EXTENSIVE COLLECTION OF MCQS, THIS BOOK EMPOWERS YOU TO ASSESS YOUR GRASP OF THE SUBJECT MATTER AND YOUR PROFICIENCY LEVEL. BY ENGAGING WITH THESE MULTIPLE-CHOICE QUESTIONS, YOU CAN IMPROVE YOUR KNOWLEDGE OF THE SUBJECT, IDENTIFY AREAS FOR IMPROVEMENT, AND LAY A SOLID FOUNDATION. DIVE INTO THE NEVER LET ME GO MCQ TO EXPAND YOUR NEVER LET ME GO KNOWLEDGE AND EXCEL IN QUIZ COMPETITIONS, ACADEMIC STUDIES, OR PROFESSIONAL ENDEAVORS. THE ANSWERS TO THE QUESTIONS ARE PROVIDED AT THE END OF EACH PAGE, MAKING IT EASY FOR PARTICIPANTS TO VERIFY THEIR ANSWERS AND PREPARE EFFECTIVELY.",
    "image": "https://books.google.com/books/content?id=wF8NEQAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "CHANGDER OUTLINE",
    "yearPublished": 2024,
    "category": "Antiques & Collectibles",
    "ISBN": "",
    "language": "en",
    "pages": 29,
    "format": "BOOK",
    "averageRating": 0
  }
]