[
  {
    "_id": "9781775235422",
    "googleId": "LT7TvQEACAAJ",
    "title": "Call Me by Your Name",
    "authors": [
      "Alex Heeney"
    ],
    "description": "",
    "image": "https://books.google.com/books/content?id=LT7TvQEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2018,
    "category": "",
    "ISBN": "9781775235422",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "_id": "",
    "googleId": "64oNnQEACAAJ",
    "title": "Call Me by My Name",
    "authors": [
      "Ruby Turner"
    ],
    "description": "",
    "image": "https://books.google.com/books/content?id=64oNnQEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": null,
    "category": "",
    "ISBN": "",
    "language": "en",
    "pages": 0,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "_id": "9780374707729",
    "googleId": "ar4j52mEdLoC",
    "title": "Call Me by Your Name",
    "authors": [
      "André Aciman"
    ],
    "description": "Now a Major Motion Picture from Director Luca Guadagnino, Starring Armie Hammer and Timothée Chalamet, and Written by Three-Time OscarTM Nominee James Ivory The Basis of the Oscar-Winning Best Adapted Screenplay A New York Times Bestseller A USA Today Bestseller A Los Angeles Times Bestseller A Vulture Book Club Pick An Instant Classic and One of the Great Love Stories of Our Time Andre Aciman's Call Me by Your Name is the story of a sudden and powerful romance that blossoms between an adolescent boy and a summer guest at his parents’ cliffside mansion on the Italian Riviera. Each is unprepared for the consequences of their attraction, when, during the restless summer weeks, unrelenting currents of obsession, fascination, and desire intensify their passion and test the charged ground between them. Recklessly, the two verge toward the one thing both fear they may never truly find again: total intimacy. It is an instant classic and one of the great love stories of our time. Winner of the Lambda Literary Award for Ficition A New York Times Notable Book of the Year • A Publishers Weekly and The Washington Post Best Book of the Year • A New York Magazine \"Future Canon\" Selection • A Chicago Tribune and Seattle Times (Michael Upchurch's) Favorite Favorite Book of the Year",
    "image": "https://books.google.com/books/content?id=ar4j52mEdLoC&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Farrar, Straus and Giroux",
    "yearPublished": 2008,
    "category": "Fiction",
    "ISBN": "9780374707729",
    "language": "en",
    "pages": 256,
    "format": "BOOK",
    "averageRating": 4
  },
  {
    "_id": "",
    "googleId": "VnXlzQEACAAJ",
    "title": "Call Me by My Real Name",
    "authors": [
      "Anna Nicole Rhodes"
    ],
    "description": "",
    "image": "https://books.google.com/books/content?id=VnXlzQEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2020,
    "category": "",
    "ISBN": "",
    "language": "en",
    "pages": 108,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "_id": "9780620555104",
    "googleId": "0UmizQEACAAJ",
    "title": "Call Me by My Rightful Name",
    "authors": [
      "Cindy-Lee Visagie"
    ],
    "description": "",
    "image": "https://books.google.com/books/content?id=0UmizQEACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": null,
    "category": "",
    "ISBN": "9780620555104",
    "language": "en",
    "pages": 114,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "_id": "9780738812465",
    "googleId": "36-nPwAACAAJ",
    "title": "Call Me Jillian",
    "authors": [
      "Vicky Rudy"
    ],
    "description": "Call Me Jillian is the emotional journey of a small town southern girl. Jilly Sue begins her journey as an unwed pregnant teenager in the hills of Arkansas. Against the backdrop of three historic decades, she overcomes self & an emotionally abusive husband, finding first her soul, then her soul mate.",
    "image": "https://books.google.com/books/content?id=36-nPwAACAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2000,
    "category": "Fiction",
    "ISBN": "9780738812465",
    "language": "en",
    "pages": 316,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "_id": "",
    "googleId": "wR6oAAAAIAAJ",
    "title": "Call Me by My Rightful Name",
    "authors": [
      "Isidore Okpewho"
    ],
    "description": "A young African American falls into periodic spasms and chants a text that nobody understands. His troubled family seeks help. The text, recorded by a psychiatrist and deciphered by linguists, is found to be a corrupted family chant from the Yoruba of Nigeria. The doctor advises a trip to that ethnic region. The spiritual voices that have been summoning Otis finally bring him to the spot where his ancestor was enslaved over a century before. Two years on, armed with a recovered identity and a chastened wisdom, Otis returns to the U.S. to join the 1960s civil rights struggle.",
    "image": "https://books.google.com/books/content?id=wR6oAAAAIAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Africa Research and Publications",
    "yearPublished": 2004,
    "category": "African American men",
    "ISBN": "",
    "language": "en",
    "pages": 272,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "_id": "",
    "googleId": "mFtmAAAAMAAJ",
    "title": "Call Me by My Name",
    "authors": [
      "Lindiwe Mthembu-Salter"
    ],
    "description": "A exhaustive list of Nguni African names (Zulu and Xhosa) and their meaning arranged alphabetically as well as by theme.",
    "image": "https://books.google.com/books/content?id=mFtmAAAAMAAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "",
    "yearPublished": 2001,
    "category": "Language Arts & Disciplines",
    "ISBN": "",
    "language": "en",
    "pages": 108,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "_id": "",
    "googleId": "bS7mEAAAQBAJ",
    "title": "THE CALL OF THE WILD WEST - Ultimate Western Collection: 175+ Novels & Short Stories in One Volume",
    "authors": [
      "Mark Twain",
      "James Fenimore Cooper",
      "Max Brand",
      "James Oliver Curwood",
      "B. M. Bower",
      "Zane Grey",
      "Jackson Gregory",
      "Jack London",
      "William MacLeod Raine",
      "William Patterson White",
      "Rex Beach",
      "Emerson Hough",
      "Will Lillibridge",
      "Andy Adams",
      "Bret Harte",
      "Owen Wister",
      "Washington Irving",
      "Willa Cather",
      "O. Henry",
      "Grace Livingston Hill",
      "Charles King",
      "Charles Alden Seltzer",
      "Stephen Crane",
      "Dane Coolidge",
      "Marah Ellis Ryan",
      "Francis William Sullivan",
      "Frederic Homer Balch",
      "Frederic Remington",
      "Robert W. Chambers",
      "Forrestine C. Hooker",
      "James B. Hendryx",
      "Frank H. Spearman",
      "J. Allan Dunn",
      "Ann S. Stephens",
      "Robert E. Howard",
      "Clarence E. Mulford",
      "R.M. Ballantyne",
      "Charles Siringo",
      "Isabel E. Ostrander",
      "Frederic Logan Paxson"
    ],
    "description": "This carefully edited collection of world's most admired westerns will take you on a roller coaster ride through the plains of Wild West, the old trails, gold rush adventures, frontier sagas and more! Introduction The Last American Frontier – History of the 'Far West', of the Pioneers & Trailblazers Story of the Cowboy Story of the Outlaw Novels & Stories Riders of the Purple Sage Saga (Zane Grey) Ohio River Trilogy Dan Barry Series (Max Brand) The Virginian (Owen Wister) Lin McLean Leatherstocking Series (James F. Cooper) Flying U Series (B. M. Bower) Cabin Fever Rimrock Trail (J. Allan Dunn) Bucky O'Connor (William M. Raine) Breckinridge Elkins Series (Robert E. Howard) In a Hollow of the Hills (Bret Harte) Wolf Hunters (James Oliver Curwood) Gold Hunters Last of the Plainsmen Border Legion Smoke Bellew Country Beyond Lone Star Ranger Ronicky Doone Trilogy Riders of the Silences Three Partners Man of the Forest Lure of the Dim Trails Tennessee's Partner Covered Wagon (Emerson Hough) Luck of Roaring Camp Rustlers of Pecos County Pike Bearfield Series Hopalong Cassidy (Clarence E. Mulford) O Pioneers! (Willa Cather) My Ántonia Roughing It (Mark Twain) Outcasts of Poker Flat Call of the Wild (Jack London) Heart of the West (O. Henry) White Fang Log of a Cowboy (Andy Adams) Two-Gun Man (Charles Alden Seltzer) Short Cut (Jackson Gregory) Astoria (Washington Irving) Ungava (R.M. Ballantyne) Valley of Silent Men Black Jack Bull Hunter \"Drag\" Harlan (Charles Alden Seltzer) Wyoming: A Story of the Outdoor West Sheriff's Son Whispering Smith (Frank H. Spearman) A Texas Cow Boy (Charles Siringo) Boss of the Lazy Y Trail Horde Rider of Golden Bar (William P. White) Buck Peters, Ranchman Tangled Trail Golden Dream (Ballantyne) Gun-Brand (James B. Hendryx) Blue Hotel (Stephen Crane) Long Shadow Girl from Montana (Grace Livingston Hill) Hidden Children (Robert W. Chambers) Where the Trail Divides Iron Trail (Rex Beach) Desert Trail (Dane Coolidge) Bride Comes to Yellow Sky ...",
    "image": "https://books.google.com/books/content?id=bS7mEAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Good Press",
    "yearPublished": 2024,
    "category": "Fiction",
    "ISBN": "",
    "language": "en",
    "pages": 15296,
    "format": "BOOK",
    "averageRating": 0
  },
  {
    "_id": "9781637581506",
    "googleId": "5vNUEAAAQBAJ",
    "title": "They Call Me Ishmael",
    "authors": [
      "John D. Kuhns"
    ],
    "description": "Set in the South Pacific and based on true events, this is a novel about war, gold, interracial friendship, and the emergence of a new nation. Growing up in Bougainville, an island archipelago in the South Pacific, Ishmael always wanted to be a soldier. The Crisis—a brutal civil war with Papua New Guinea ignited by the gargantuan Panguna Mine—gives him his chance. As the guerrilla leader of the Bougainville Revolutionary Army, Ishmael secures a peace agreement that provides his islands with a measure of autonomy and the future right to conduct an independence referendum. If the people vote affirmatively, Bougainville could become the newest nation on earth. In the aftermath of the Crisis, Bougainville’s corrupt and inept government causes a vacuum. From its perch across the Pacific, China salivates. They covet Bougainville, both for its Panguna Mine and its strategic location, and are prepared to do whatever it takes to grab it. When Ishmael and Bougainville’s chiefs ask Jack Davis, a pin-striped American investor, to help rebuild their economy, he is intrigued. Although primitive, Bougainville holds billions in gold and copper, and its people seem lovely. Jack’s life has been comfortable, but things are changing. His family members have moved on with their lives, and his country doesn’t seem to value people like him anymore. Maybe Bougainville would be different. That two men—one black and one white—from totally different walks of life could meet on a remote island and decide they stand for the same things is a testament to Bougainville and its people, and shapes a story that anyone who believes in the innate goodness of humanity should read. The fact that it all really happened is truly inspirational.",
    "image": "https://books.google.com/books/content?id=5vNUEAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&source=gbs_api",
    "publisher": "Simon and Schuster",
    "yearPublished": 2022,
    "category": "Fiction",
    "ISBN": "9781637581506",
    "language": "en",
    "pages": 403,
    "format": "BOOK",
    "averageRating": 0
  }
]